//  a) Реализовать класс квадратной матрицы произвольного размера и для него операции сложения, умножения,
//     деления, нахождение определителя и транспонирования. При невозможности выполнить какую-либо операцию
//     генерируйте исключение (Объект исключение должен быть объектом пользовательского класса,
//     пронаследованного от Exception). Реализовать интерфейс ICloneable. Добавить возможность работы с элементами
//     матрицы в цикле foreach. Примечание. Класс должен содержать не менее 3 различных конструкторов.
// b) Реализуйте обобщенный класс полиномов. Ваш класс должен содержать не менее 3 конструкторов, иметь перегрузки
//     всех стандартных арифметических операций над полиномами, иметь метод вычисления значения полинома
//     в заданной точке и метод позволяющий вычислять композицию двух полиномов. Реализуйте возможность копирования
//     полиномов, сравнения полиномов и возможность выбирать коэффициенты в цикле foreach.
//     Для демонстрации возможностей вашего класса используйте класс матрицы из пункта а)  Срок сдачи до 11 апреля. 
using System;

namespace lab10
{
    class Program
    {
        static void Main(string[] args)
        {
            
        }
    }
}