// «Построитель СДНФ/СКНФ». С использованием стандартных коллекций реализовать программу, которая для любой
// булевой формулы строит СДНФ и СКНФ. Программа должна не только выводить ответ, но и выводить трассировку своей
// работы. При этом входными данными программы является текстовый файл, в котором находится произвольное число
// булевых формул. Результатом работы программы является файл с СДНФ и СКНФ для каждой формулы. Срок сдачи до 30 мая.

using System;

namespace lab14
{
    internal class Program
    {
        public static void Main(string[] args)
        {
            var s = "←";
            Console.WriteLine(s);
        }
    }
}